In [1]:
import pandas as pd

In [2]:
df =pd.read_csv("/content/Social_Network_Ads.csv")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
inputs = df.drop('Purchased',axis = 'columns')
target = df.Purchased

In [4]:
#inputs.Gender = inputs.Gender.map({'male':1,'female:2})

In [5]:
dummies = pd.get_dummies(inputs.Gender)
dummies.head(3)

   Female  Male
0       0     1
1       0     1
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies],axis ='columns')
inputs.head(3)

    User ID  Gender  Age  EstimatedSalary  Female  Male
0  15624510    Male   19            19000       0     1
1  15810944    Male   35            20000       0     1
2  15668575  Female   26            43000       1     0

drorpped male column as well because of dummy variable trap theory.One column is enough to represent male vs female

In [7]:
inputs.drop(['Gender','Female'],axis ='columns',inplace= True)
inputs.head(3)

    User ID  Age  EstimatedSalary  Male
0  15624510   19            19000     1
1  15810944   35            20000     1
2  15668575   26            43000     0

In [8]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [9]:
inputs.Age[:10]

0    19
1    35
2    26
3    27
4    19
5    27
6    27
7    32
8    25
9    35
Name: Age, dtype: int64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

    User ID  Age  EstimatedSalary  Male
0  15624510   19            19000     1
1  15810944   35            20000     1
2  15668575   26            43000     0
3  15603246   27            57000     0
4  15804002   19            76000     1

In [11]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size =0.3)

In [12]:
len(X_train)

280

In [13]:
len(X_test)

120

In [14]:
len(inputs)

400

In [15]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [16]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [17]:
model.score(X_test,y_test)

0.9083333333333333

In [18]:
X_test[0:10]

      User ID  Age  EstimatedSalary  Male
292  15625395   55            39000     1
98   15575694   35            73000     1
205  15766609   47            47000     0
70   15756932   25            80000     1
27   15633531   47            30000     0
181  15774727   31            71000     0
51   15764195   18            44000     0
132  15725660   30            87000     1
102  15584545   32            86000     0
308  15596761   36           125000     1

In [19]:
y_test[0:10]

292    1
98     0
205    0
70     0
27     1
181    0
51     0
132    0
102    0
308    1
Name: Purchased, dtype: int64

In [20]:
model.predict(X_test[0:10])

array([1, 0, 1, 0, 0, 0, 0, 0, 0, 1])

In [21]:
model.predict_proba(X_test[:10])

array([[0.21561585, 0.78438415],
       [0.89120057, 0.10879943],
       [0.48109923, 0.51890077],
       [0.9536704 , 0.0463296 ],
       [0.50988909, 0.49011091],
       [0.91107657, 0.08892343],
       [0.98915098, 0.01084902],
       [0.88823346, 0.11176654],
       [0.89218231, 0.10781769],
       [0.28685591, 0.71314409]])

Calculate the score using cross validation

In [22]:
from sklearn.model_selection import  cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.83928571, 0.875     , 0.875     , 0.89285714, 0.78571429])